In [1]:
import pandas as pd

In [3]:
d1=pd.read_excel(r"C:\Users\Rohit\Desktop\jupyterpy\Employee data.xlsx")

In [5]:
d1

,Employee ID,Employee Name,Manager Name,Department,Qualification,Gender,Experience,Salary
0,E001,Pooja Thorat,Vishal Bhosale,Finance,Bachelor,Female,18,103464
1,E002,Shruti Sawant,Neelam Sawant,Engineering,PhD,Male,9,126942
2,E003,Rupal Kulkarni,Aparna Jadhav,HR,PhD,Male,14,129882
3,E004,Shweta Pawar,Siddhi Bhosale,Sales,PhD,Male,2,71092
4,E005,Snehal Jadhav,Siddhi Rathod,Finance,Bachelor,Female,8,104760
...,...,...,...,...,...,...,...,...
95,E096,Gaurav Pawar,Siddhi Rathod,Engineering,Bachelor,Female,6,92906
96,E097,Tejas Mane,Sandeep Gore,Sales,Master,Male,8,64956
97,E098,Madhavi Kadam,Sandeep Rathod,Finance,PhD,Male,11,119764
98,E099,Neha Jadhav,Rajesh Patil,Sales,Diploma,Male,1,76522
99,E100,Neha Chavan,Shubham Rathod,Engineering,PhD,Female,12,63238

In [ ]:
# How many employees are there in each department?

In [13]:
dep_count = d1.groupby('Department')['Employee ID'].count()

In [15]:
dep_count

Department
Engineering    12
Finance        20
HR             13
Marketing      18
Operations     18
Sales          19
Name: Employee ID, dtype: int64

In [17]:
dep_count.reset_index()

    Department  Employee ID
0  Engineering           12
1      Finance           20
2           HR           13
3    Marketing           18
4   Operations           18
5        Sales           19

In [21]:
d1.groupby('Department')['Salary'].mean().reset_index()

    Department         Salary
0  Engineering  111970.833333
1      Finance  104037.800000
2           HR  101945.076923
3    Marketing   99690.500000
4   Operations   86655.500000
5        Sales   84412.263158

In [ ]:
# unique

In [29]:
d1['Gender'].unique()

array(['Female', 'Male'], dtype=object)

In [ ]:
# nuinque

In [31]:
d1['Gender'].nunique()

2

In [33]:
d1.groupby('Gender')['Employee ID'].count().reset_index()

   Gender  Employee ID
0  Female           44
1    Male           56

In [41]:
d1.groupby(['Gender','Department'])['Employee ID'].count().reset_index()

    Gender   Department  Employee ID
0   Female  Engineering            7
1   Female      Finance            7
2   Female           HR            5
3   Female    Marketing            7
4   Female   Operations           12
5   Female        Sales            6
6     Male  Engineering            5
7     Male      Finance           13
8     Male           HR            8
9     Male    Marketing           11
10    Male   Operations            6
11    Male        Sales           13

In [ ]:
# What is the average salary for each gender?

In [47]:
d1.groupby('Gender')["Salary"].mean().reset_index()

   Gender        Salary
0  Female  95179.977273
1    Male  98568.464286

In [55]:
x=d1.groupby(['Gender','Department'])["Salary"].mean().reset_index()

In [57]:
x

    Gender   Department         Salary
0   Female  Engineering  104965.000000
1   Female      Finance  100104.428571
2   Female           HR  101190.600000
3   Female    Marketing  102852.714286
4   Female   Operations   91468.666667
5   Female        Sales   71481.166667
6     Male  Engineering  121779.000000
7     Male      Finance  106155.769231
8     Male           HR  102416.625000
9     Male    Marketing   97678.181818
10    Male   Operations   77029.166667
11    Male        Sales   90380.461538

In [ ]:
# What is the average salary for employees in each depar

In [59]:
x1=d1.groupby('Department')["Salary"].mean().reset_index()

In [61]:
x1

    Department         Salary
0  Engineering  111970.833333
1      Finance  104037.800000
2           HR  101945.076923
3    Marketing   99690.500000
4   Operations   86655.500000
5        Sales   84412.263158

In [63]:
x1=d1.groupby('Department')["Salary"].sum().reset_index()

In [65]:
x1

    Department   Salary
0  Engineering  1343650
1      Finance  2080756
2           HR  1325286
3    Marketing  1794429
4   Operations  1559799
5        Sales  1603833

In [67]:
x1=d1.groupby('Department')["Salary"].count()

In [69]:
x1

Department
Engineering    12
Finance        20
HR             13
Marketing      18
Operations     18
Sales          19
Name: Salary, dtype: int64

In [75]:
k=d1.groupby('Department').agg({'Salary':'mean','Experience':'mean'})

In [77]:
k

                    Salary  Experience
Department
Engineering  111970.833333   12.166667
Finance      104037.800000   13.500000
HR           101945.076923   11.230769
Marketing     99690.500000   12.111111
Operations    86655.500000   11.833333
Sales         84412.263158   12.210526

In [83]:
k=d1.groupby('Department').agg({'Salary':['mean','sum','count'],'Experience':['mean','count']})

In [85]:
k

                    Salary                Experience
                      mean      sum count       mean count
Department
Engineering  111970.833333  1343650    12  12.166667    12
Finance      104037.800000  2080756    20  13.500000    20
HR           101945.076923  1325286    13  11.230769    13
Marketing     99690.500000  1794429    18  12.111111    18
Operations    86655.500000  1559799    18  11.833333    18
Sales         84412.263158  1603833    19  12.210526    19

In [89]:
d1['Department'].unique()

array(['Finance', 'Engineering', 'HR', 'Sales', 'Operations', 'Marketing'],
      dtype=object)

In [91]:
d1['Qualification'].unique()

array(['Bachelor', 'PhD', 'Diploma', 'Master'], dtype=object)

In [95]:
#Returns the count of unique values in a column
d1['Qualification'].value_counts().reset_index()

  Qualification  count
0           PhD     37
1      Bachelor     23
2       Diploma     20
3        Master     20

In [97]:
d1['Employee Name'].str.upper()

0       POOJA THORAT
1      SHRUTI SAWANT
2     RUPAL KULKARNI
3       SHWETA PAWAR
4      SNEHAL JADHAV
           ...
95      GAURAV PAWAR
96        TEJAS MANE
97     MADHAVI KADAM
98       NEHA JADHAV
99       NEHA CHAVAN
Name: Employee Name, Length: 100, dtype: object

In [101]:
d1['Manager Name'].str.lower()

0     vishal bhosale
1      neelam sawant
2      aparna jadhav
3     siddhi bhosale
4      siddhi rathod
           ...
95     siddhi rathod
96      sandeep gore
97    sandeep rathod
98      rajesh patil
99    shubham rathod
Name: Manager Name, Length: 100, dtype: object

In [103]:
d1.head()

,Employee ID,Employee Name,Manager Name,Department,Qualification,Gender,Experience,Salary
0,E001,Pooja Thorat,Vishal Bhosale,Finance,Bachelor,Female,18,103464
1,E002,Shruti Sawant,Neelam Sawant,Engineering,PhD,Male,9,126942
2,E003,Rupal Kulkarni,Aparna Jadhav,HR,PhD,Male,14,129882
3,E004,Shweta Pawar,Siddhi Bhosale,Sales,PhD,Male,2,71092
4,E005,Snehal Jadhav,Siddhi Rathod,Finance,Bachelor,Female,8,104760

In [105]:
d1['Department'].str.replace('HR' , 'Human Resource')

0            Finance
1        Engineering
2     Human Resource
3              Sales
4            Finance
           ...
95       Engineering
96             Sales
97           Finance
98             Sales
99       Engineering
Name: Department, Length: 100, dtype: object

In [107]:
d1['Employee Name'].str.replace('Pooja Thorat' , 'Pooja Sharma')

0       Pooja Sharma
1      Shruti Sawant
2     Rupal Kulkarni
3       Shweta Pawar
4      Snehal Jadhav
           ...
95      Gaurav Pawar
96        Tejas Mane
97     Madhavi Kadam
98       Neha Jadhav
99       Neha Chavan
Name: Employee Name, Length: 100, dtype: object